// Циклы
//
// 1Найти сумму четных чисел и их количество в диапазоне от 1 до 99
// var sum = 0;
// var counter = 0;
// for(var i = 2; i < 99; i++){
//     if(i % 2 === 0){
//         sum += i;
//         counter ++;
//     }
// }
// console.log(counter);



// 2Проверить простое ли число? (число называется простым, если оно делится только само на себя и на 1)
// var num = -13;
// var prostoe = true;
// if(num < 0 || num % 1 !== 0){
//     console.log('invalid');
//     return;
// }
//     for (i = 2; i < num; i++) {
//         if (num % i === 0) {
//             prostoe = false;
//         }
//     }
//
// console.log(prostoe);
// // 2/n = 2.0  2.2/n = 2.2


// 3Найти корень натурального числа с точностью до целого (рассмотреть вариант последовательного подбора и метод бинарного поиска)
var a = [1,2,3,4,5,6,7,8,9,10];
for ()



// 4Вычислить факториал числа n. n! = 1*2*…*n-1*n;
// 5Посчитать сумму цифр заданного числа
// 6Вывести число, которое является зеркальным отображением последовательности цифр заданного числа, например, задано число 123, вывести 321.
// var sum = 0;
// var counter = 0;
// for(var i = 2; i < 99; i++){
//     if(i % 2 === 0){
//         sum += i;
//         counter ++;
//     }
// }
// console.log(counter);

// var sum = 0;
// var counter = 0;
// for(var i = 2; i < 99; i+=2){
//     sum += i;
//     counter ++;
// }
// console.log(counter);





// var sum = 0;
// var counter = 0;
// for(var i = 1; i < 50; i+=2){
//     sum += i;
//     counter++;
// }
// console.log(counter);
